## Staging
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 2 to add, 3 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                    RESOURCE                     |
|--------|-------------------------------------------------|
| add    | `aws_elasticache_cluster.superset_cache`        |
|        | `aws_elasticache_subnet_group.superset_cache`   |
| update | `module.celery_beat_ecs.aws_ecs_service.this`   |
|        | `module.celery_worker_ecs.aws_ecs_service.this` |
|        | `module.superset_ecs.aws_ecs_service.this`      |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_elasticache_cluster.superset_cache will be created
  + resource "aws_elasticache_cluster" "superset_cache" {
      + apply_immediately          = (known after apply)
      + arn                        = (known after apply)
      + auto_minor_version_upgrade = "true"
      + availability_zone          = (known after apply)
      + az_mode                    = (known after apply)
      + cache_nodes                = (known after apply)
      + cluster_address            = (known after apply)
      + cluster_id                 = "superset-cache-staging"
      + configuration_endpoint     = (known after apply)
      + engine                     = "valkey"
      + engine_version             = "7.2"
      + engine_version_actual      = (known after apply)
      + id                         = (known after apply)
      + ip_discovery               = (known after apply)
      + maintenance_window         = (known after apply)
      + network_type               = (known after apply)
      + node_type                  = "cache.t2.micro"
      + num_cache_nodes            = 1
      + parameter_group_name       = "default.valkey7"
      + port                       = 6379
      + preferred_outpost_arn      = (known after apply)
      + replication_group_id       = (known after apply)
      + security_group_ids         = [
          + "sg-0bbd0c9ae06f8f8ff",
        ]
      + snapshot_window            = (known after apply)
      + subnet_group_name          = "superset-cache-staging"
      + tags                       = {
          + "CostCentre" = "cds-superset-staging"
          + "Terraform"  = "true"
        }
      + tags_all                   = {
          + "CostCentre" = "cds-superset-staging"
          + "Terraform"  = "true"
        }
      + transit_encryption_enabled = (known after apply)
    }

  # aws_elasticache_subnet_group.superset_cache will be created
  + resource "aws_elasticache_subnet_group" "superset_cache" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + id          = (known after apply)
      + name        = "superset-cache-staging"
      + subnet_ids  = [
          + "subnet-06dd9e2b7842765e7",
          + "subnet-0ce2d9078c46c1ec7",
        ]
      + tags_all    = (known after apply)
      + vpc_id      = (known after apply)
    }

  # module.celery_beat_ecs.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ca-central-1:257394494478:service/superset/celery-beat"
        name                               = "celery-beat"
      ~ platform_version                   = "1.4.0" -> "LATEST"
        tags                               = {
            "CostCentre" = "cds-superset-staging"
            "Terraform"  = "true"
        }
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.celery_worker_ecs.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ca-central-1:257394494478:service/superset/celery-worker"
        name                               = "celery-worker"
      ~ platform_version                   = "1.4.0" -> "LATEST"
        tags                               = {
            "CostCentre" = "cds-superset-staging"
            "Terraform"  = "true"
        }
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.superset_ecs.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ca-central-1:257394494478:service/superset/superset"
        name                               = "superset"
      ~ platform_version                   = "1.4.0" -> "LATEST"
        tags                               = {
            "CostCentre" = "cds-superset-staging"
            "Terraform"  = "true"
        }
        # (16 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

Plan: 2 to add, 3 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.athena_bucket.aws_s3_bucket.this,
  on .terraform/modules/athena_bucket/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

lifecycle_rule is deprecated. Use the aws_s3_bucket_lifecycle_configuration
resource instead.

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_athena_data_catalog.data_lake[\"production\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_athena_data_catalog.data_lake[\"staging\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_elasticache_subnet_group.superset"]
WARN - plan.json - main - Missing Common Tags: ["aws_elasticache_subnet_group.superset_cache"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.superset_waf_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_kinesis_firehose_delivery_stream.superset_waf_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_regex_pattern_set.label_sizerestrictions_body_excluded_paths"]

26 tests, 19 passed, 7 warnings, 0 failures, 0 exceptions

```

</details>
